Revit 2024 API
ElementQuickFilter Class
 A base class for a type of filter that operates on element records.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class ElementQuickFilter : ElementFilter
Visual Basic
Public Class ElementQuickFilter _
	Inherits ElementFilter
Visual C++
public ref class ElementQuickFilter : public ElementFilter
Remarks
 Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.BoundingBoxContainsPointFilter
 Autodesk.Revit.DB.BoundingBoxIntersectsFilter
 Autodesk.Revit.DB.BoundingBoxIsInsideFilter
 Autodesk.Revit.DB.ElementCategoryFilter
 Autodesk.Revit.DB.ElementClassFilter
 Autodesk.Revit.DB.ElementDesignOptionFilter
 Autodesk.Revit.DB.ElementIdSetFilter
 Autodesk.Revit.DB.ElementIsCurveDrivenFilter
 Autodesk.Revit.DB.ElementIsElementTypeFilter
 Autodesk.Revit.DB.ElementMulticategoryFilter
 Autodesk.Revit.DB.ElementMulticlassFilter
 Autodesk.Revit.DB.ElementOwnerViewFilter
 Autodesk.Revit.DB.ElementStructuralTypeFilter
 Autodesk.Revit.DB.ElementWorksetFilter
 Autodesk.Revit.DB.ExclusionFilter
 Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter
 Autodesk.Revit.DB.FamilySymbolFilter
 Autodesk.Revit.DB.VisibleInViewFilter
See Also
ElementQuickFilter Members
Autodesk.Revit.DB Namespace